ThirdParty-v1912/swak4Foam-latest/Examples/Lagrangian/parser/parcelInBoxWithExpressions/constant/chemistryProperties.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

psiChemistryModel  ODEChemistryModel<gasThermoPhysics>;

chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   rho;
}

chemistrySolver ode;

chemistry       off;

turbulentReaction off;

initialChemicalTimeStep 1e-07;

sequentialCoeffs
{
    cTauChem        0.001;
    equilibriumRateLimiter off;
}

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
<!--(if foamVersion>=(2,3) and foamFork in ["openfoam","openfoamplus"])-->
    solver          seulex;
<!--(else)-->
    solver          RK;
<!--(end)-->
    ODESolver $solver;
    eps             0.05;
    scale     1;
}


// ************************************************************************* //
