ThirdParty-v1912/swak4Foam-latest/Examples/Lagrangian/parser/parcelInBoxWithExpressions/constant/reactions
species
(
    air
    H2O
);

reactions
{}
